app/views/food_items/_food_item.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."food_item_id" = $1  [["food_item_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."food_item_id" = $1  [["food_item_id", 8]]
---
			<%= image_tag("comments.png", height: "10")%>
			<%= food_item.reviews.count %>