app/views/food_items/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."food_item_id" = $1  [["food_item_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."food_item_id" = $1  [["food_item_id", 48]]
---
            <%= image_tag("comments.png", height: "10")%>
            <%= @food_item.reviews.count %>