app/controllers/food_items_controller.rb

  def index
    @food_items = FoodItem.all
---
SELECT "food_items".* FROM "food_items"

    def set_food_item
      @food_item = FoodItem.find(params[:id])
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]