app/controllers/line_items_controller.rb

SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "line_items" ("food_item_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["food_item_id", 3], ["cart_id", 1], ["created_at", "2017-06-18 11:53:54.551460"], ["updated_at", "2017-06-18 11:53:54.551460"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2017-06-18 13:43:40.795617"], ["id", 2]]
---
  def create
    food_item = FoodItem.find(params[:food_item_id])
    @line_item = @cart.add_food_item(food_item)

    respond_to do |format|
      if @line_item.save