app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("username", "content", "food_item_id", "created_at", "updated_at", "rate") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "asdf"], ["content", "asdfsda"], ["food_item_id", 48], ["created_at", "2017-06-18 16:18:06.025960"], ["updated_at", "2017-06-18 16:18:06.025960"], ["rate", "1.0"]]
---
  def create
    @review = @food_item.reviews.create(review_params)

SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_food_item
      @food_item = FoodItem.find(params[:food_item_id])