app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
SELECT "cuisines".* FROM "cuisines"
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "food_items".* FROM "food_items" WHERE "food_items"."section_id" = $1 ORDER BY impressionist_count desc  [["section_id", 1]]
SELECT "food_items".* FROM "food_items" ORDER BY impressions_count desc
SELECT  "cuisines".* FROM "cuisines" WHERE "cuisines"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "food_items".* FROM "food_items" WHERE "food_items"."cuisine_id" = $1 ORDER BY price desc  [["cuisine_id", 1]]
---
	def index
		@sections = Section.all
		@cuisines = Cuisine.all
		if params[:section_id].present?
			@food_items = Section.find(params[:section_id]).food_items.all
		else
			@food_items = FoodItem.all
		end

		if params[:cuisine_id].present?
			@food_items = Cuisine.find(params[:cuisine_id]).food_items.all