app/views/layouts/_cart_text.html.erb

SELECT SUM("line_items"."quantity") FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
---
<%= link_to "Cart(#{@cart.line_items.sum("quantity")})", my_cart_path, method: :get %>